# -*- coding: utf-8 -*-

""" OR """
t1 = 5 | 6

print(f'5 в бинарном виде {bin(5)}')
print(f'6 в бинарном виде {bin(6)}')
print(f'результат "ИЛИ" в бинарном виде {bin(t1)}')
print(f'результат "ИЛИ" в десятичном виде {t1}')

""" AND """
t2 = 5 & 6

print(f'результат "И" в бинарном виде {bin(t2)}')
print(f'результат "И" в десятичном виде {t2}')

""" XOR """
t3 = 5 ^ 6

print(f'результат "XOR" в бинарном виде {bin(t3)}')
print(f'результат "XOR" в десятичном виде {t3}')


t4 = 5 << 2

print(f'результат "2 bits left" в бинарном виде {bin(t4)}')
print(f'результат "2 bits left" в десятичном виде {t4}')

t5 = 5 >> 2

print(f'результат "2 bits right" в бинарном виде {bin(t5)}')
print(f'результат "2 bits right" в десятичном виде {t5}')